---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.StructuralSectionGeneralShape
source: html/798932c4-8fde-4c1f-1dc4-1b5524bdee9d.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.StructuralSectionGeneralShape Property

The general type of structural section shape.

## Syntax (C#)
```csharp
public StructuralSectionGeneralShape StructuralSectionGeneralShape { get; }
```